#lang racket

(display "Это LISP :) ")
(display "Тут можно складывать сразу много чисел: ")
(+ 1 2 4 -10)
(display " ..и умножать тоже... ")
(* 2 3 4)
(display ".. вычитаем из первого аргумента все остальные..")
(- 10 5 5)
(display ".. делим первый аргумент на все остальные..")
(/ 1 2 3)

(display "Остаток от деления 5 на 3: ")
(remainder 5 3)

(display "Логические операции: ")
(eq? 2 1) 

(display "Логическое И: ")
(and #f #f) (and #f #t) (and #t #f) (and #t #t)

(display "Логическое ИЛИ: ") (newline)
(or #f #f) (or #f #t) (or #t #f) (or #t #t)

(display "Сравнение (операция равно): ")
(eq? 2 1) 

(display "Не равно: ")
(not (eq? 2 1))

