<html>
<head>
    <meta http-equiv=Content-Type content="text/html; charset=utf-8">
    <title>Разбор задач командной олимпиады</title>
    <link rel="stylesheet" type="text/css" href="../style/style.css">
    <script type="text/javascript" src="../syntax/sh_main.min.js"></script>
    <script type="text/javascript" src="../syntax/sh_cpp.min.js"></script>
    <script type="text/javascript" src="../syntax/sh_pascal.min.js"></script>
    <link type="text/css" rel="stylesheet" href="../style/sh_nedit.css">
    <script type="text/x-mathjax-config">
        MathJax.Hub.Config({tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}});


    </script>
    <script type="text/javascript"
            src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
    </script>
</head>
<body onLoad="sh_highlightDocument();">
<div style="width:80%;">
    <div style="float:right;">
        <object classid="clsid:D27CDB6E-AE6D-11cf-96B8-444553540000"
                codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,0,0"
                width="100" height="50">
            <param name="movie"
                   value="../audio/a_smsqulh3n.swf">
            <param name="bgcolor" value="fff">
            <param
                    name="FlashVars" value="src=9094e666f613f513f50301------------ffffff">
            <param
                    name="autoplay" value="false">
            <embed src="../audio/a_smsqulh3n.swf" bgcolor="fff"
                   width="100" height="70" type="application/x-shockwave-flash"
                   pluginspage="http://www.macromedia.com/go/getflashplayer"
                   FlashVars="src=9094e666f613f513f50301------------ffffff"></embed>
        </object>
    </div>
</div>

<div id="content">

    <h1>Разбор задач Нижегородской олимпиады школьников 2007 года</h1>

    <h2>1. Бассейны и трубы</h2>

    <p>В новом аквапарке есть $N$ бассейнов, заполненных водой. Некоторые пары
        бассейнов соединены трубами, всего труб $M$. Система труб построена так,
        чтобы из любого бассейна в любой другой можно было при необходимости перегнать воду,
        возможно, воспользовавшись другими бассейнами как промежуточными.
        На каждой трубе стоит программируемый насос, который способен
        перекачивать в любую сторону произвольный заданный поток воды.
        Кроме того, в некоторые бассейны дополнительно втекает
        вода с известной скоростью, а из некоторых вода вытекает - тоже
        с известной скоростью.</p>

    <p>Ваша задача - написать программу, которая отрегулирует
        насосы так, чтобы уровень воды в бассейнах поддерживался постоянным.</p>

    <b>Решение:</b>

<pre class="sh_pascal">
const { Ограничения по условию задачи }
  maxn = 100;
  maxf = 30000;

var
  n,m : integer;
  vs : array [1..maxn] of integer;
  res : array [1..maxn,1..maxn] of longint;
  p : array [1..MaxN] of set of 1..maxn; { Есть ли труба из i в j }
    { Хорошо изучить работу с множествами на этом примере }
  v : array [1..MaxN] of boolean; { Уже были в этом бассейне }
  totx : longint;
  nnn : array [1..MaxN,1..MaxN] of integer; { Запоминаем номера рёбер из входного файла }    

{ Обход в глубину }
function dfs( i:integer ):longint;
var j,r : integer;
begin
  v[i] := true; { Ставим в момент посещения вершины } 
  Result := vs[i]; { Дизбаланс в этой вершине }
  for j:=1 to n do { Обходим все смежные вершины }
    if (j in es[i]) and not v[j] then begin
      r := dfs(j); { Рекурсивно обходим остальную часть графа }
      res[j,i] := r; res[i,j] := -r; { Записываем текущий найденный дизбаланс }
      inc(Result,r); { И возвращаем его как результат }
    end;
end;

var 
  i : integer;
  a,b : integer;
begin
  assign(input,'pools.in'); reset(input);
  assign(output,'pools.out'); rewrite(output);
  { Чтение входных данных }
  fillchar(es,sizeof(es),0);
  read(n); { Количество бассейнов }
  for i:=1 to n do read(vs[i]); { Потоки для бассейна }
  read(m); { Количество труб }
  for i:=1 to m do begin
    read(a,b); 
    include(es[a],b);
    include(es[b],a);
  end;
  { Инициализация - обнуляем все массивы }
  fillchar(was,sizeof(was),0); wasn:=0;
  fillchar(res,sizeof(res),0);
  { Основная часть решения - вызываем обход в глубину }
  if dfs(1)<>0 then begin { Если сумма всех втекающих не равна сумме вытекающих => невозможно сбалансировать }
     writeln('Impossible');
  end else begin { Если сумма равна 0, выводим сколько и куда течёт }
    reset(input);
    for i:=1 to n+2 do readln;
    for i:=1 to m do begin
      readln(a,b);
      writeln(res[a-1,b-1]);
    end;
  end;
end.
</pre>

    <h2>2. Батон</h2>

    <h2>3. Обфускатор</h2>

    <h2>4. А ты купи коня!</h2>

    <h2>5. Строительство в городе</h2>

    <h2>6. Кофе</h2>


</div>
</body>

</html>
